///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


#Область ДляВызоваИзДругихПодсистем

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
    	
	Ответственный    = Пользователи.ТекущийПользователь();
	Автор            = Пользователи.ТекущийПользователь();
	Организация		 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Автор, "bsk_ОсновнаяОрганизация");
	Склад 			 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Автор, "bsk_ОсновнойСклад");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&ВидДвижения КАК ВидДвижения,
	|	Материалы.ДатаУстановки КАК Период,
	|	Материалы.Номенклатура КАК Номенклатура,
	|	СУММА(Материалы.Количество) КАК Количество,
	|	Материалы.Ссылка.Склад КАК Склад
	|ИЗ
	|	Документ.bsk_ЗаказНаряд.Материалы КАК Материалы
	|ГДЕ
	|	Материалы.Ссылка = &СсылкаНаОбъект
	|	И Материалы.Ссылка.Состояние <> ЗНАЧЕНИЕ(Перечисление.bsk_СостоянияЗаказовНарядов.Запланирован)
	|	И Материалы.ДатаУстановки <> &ПустаяДата
	|СГРУППИРОВАТЬ ПО
	|	Материалы.ДатаУстановки,
	|	Материалы.Номенклатура,
	|	Материалы.Ссылка.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Работы.ДатаВыполнения КАК Период,
	|	&СсылкаНаОбъект КАК ЗаказНаряд,
	|	Работы.Номенклатура,
	|	СУММА(Работы.Количество) КАК Количество,
	|	СУММА(Работы.Сумма) КАК Сумма,
	|	Работы.Исполнитель КАК Сотрудник
	|ИЗ
	|	Документ.bsk_ЗаказНаряд.Работы КАК Работы
	|ГДЕ
	|	Работы.Ссылка = &СсылкаНаОбъект
	|	И Работы.Ссылка.Состояние <> ЗНАЧЕНИЕ(Перечисление.bsk_СостоянияЗаказовНарядов.Запланирован)
	|	И Работы.ДатаВыполнения <> &ПустаяДата
	|СГРУППИРОВАТЬ ПО
	|	Работы.ДатаВыполнения,
	|	Работы.Номенклатура,
	|	Работы.Исполнитель";
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ПустаяДата", Дата('00010101'));
	
	Результаты = Запрос.ВыполнитьПакет();
	
	Выборка = Результаты[0].Выбрать();
    РегистрыНакопления.bsk_МатериалыНаСкладах.ВыполнитьДвижение(ЭтотОбъект.Ссылка, Выборка);
    
    Выборка = Результаты[1].Выбрать();
    РегистрыНакопления.bsk_ВыработкаСотрудников.ВыполнитьДвижение(ЭтотОбъект.Ссылка, Выборка);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	СуммаМатериалов = Материалы.Итог("Сумма");
	СуммаРабот = Работы.Итог("Сумма");	
	СуммаДокумента = СуммаМатериалов + СуммаРабот;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
		
	Ответственный    = Пользователи.ТекущийПользователь();
	Автор            = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли